const Courses=[
    {
        id: 1,
        title: 'პროგრამირება Python - ზე',
        professor: 'მაქსიმ იავიჩი',
        text: 'სასწავლო კურსი წარმოადგენს დაპროგრამების მიმართულებით თანამედროვე სტანდარტების თეორიული და პრაქტიკული გამოყენების ათვისების საშუალებას. მასში შეისწავლება თანამედროვე, დინამიური და მულტიპარადიგმული ენა „პითონი“. რომელიც თავის თავში მოიცავს ობიექტზე ორინეტირებულ , პროცედურულ, ფუნქციონალურ და იმპერატიულ პროგრამირებას.'
    },{
        id: 2,
        title: 'გამოყენებითი უსაფრთხოება',
        professor: 'გიორგი იაშვილი',
        text: 'საგანი მსმენელებს შეასწავლის თუ როგორ უნდა გამოიყენონ უსაფრთხოების ძირითადი მექანიზმები პრაქტიკაზე. აგრეთვე, საგანი შეასწავლის მსმენელებს თუ როგორ უნდა შეაფასონ ცალკეული უსაფრთხოების სცენარი და რა უნდა გაითვალისწინონ ან/და მოიმოქმედონ სხვადასხვა კიბერ საფრთხეების წინაშე. '
    },{
        id: 3,
        title: 'ქსელური ინფრასტრუქტურა და მისი მუშაობის პრინციპები',
        professor: 'დავით ტალიაშვილი',
        text: 'სასწავლო კურსი წარმოადგენს ქსელის მიმართულებით თანამედროვე სტანდარტების თეორიული და პრაქტიკული გამოყენების ათვისების საშუალებას. მასში შეისწავლება თანამედროვე მიდგომები, რომელიც დაგეხმარებათ ქსელის დაგეგმარებაში და კონფიგურაციაში.'
    }, {
        id: 4,
        title: 'RIP, EIGRP მარშრუტიზაციის პროტოკოლები',
        professor: 'დავით ტალიაშვილი',
        text: 'სასწავლო კურსი წარმოადგენს Distance Vector მარშრუტიზაციის პროტოკოლების თეორიული და პრაქტიკული გამოყენების ათვისების საშუალებას. მასში შეისწავლება თანამედროვე მიდგომები, რომელიც დაგეხმარებათ ქსელის დაგეგმარებაში და კონფიგურაციაში.'
    },{
        id: 5,
        title: 'ვებ ტექნოლოგიები I',
        professor: 'დავით ბოჭორიშვილი',
        text: 'მსმენელები შეისწავლიან HTML და CSS ტექნოლოგიების გამოყენებით სტატიკური ვებ გვერდების შექმნის ძირითად მეთოდებს. ასევე საგანი მსმენელს შეასწავლის ინტერაქტიულ და ვიზუალურ ეფექტებს HTML და CSS ვებ ტექნოლოგიების გამოყენებით. მსმენელები შეისწავლიან მარკირების ენის ძირითად კონცეფციას და პრაქტიკაზე გამოყენებას.'
    },{
        id: 6,
        title: 'ვებ ტექნოლოგიები II',
        professor: 'თემური თაკალანძე',
        text: 'სასწავლო კურსი წარმოადგენს დაპროგრამების მიმართულებით თანამედროვე სტანდარტების თეორიული და პრაქტიკული გამოყენების ათვისების საშუალებას. მასში შეისწავლება თანამედროვე და დინამიური “PHP”, რომელიც თავის თავში მოიცავს ობიექტზე ორინეტირებულ და პროცედურლ პროგრამირებას.'
    },{
        id: 7,
        title: 'JavaScript დაპროგრამების ენა',
        professor: 'დავით ბოჭორიშვილი',
        text: 'დღეისთვის JavaScript არის ერთ-ერთი მოთხოვნადი და მოქნილი დაპროგრამების ენა, რომელიც გამოიყენება მრავალ სფეროში. JavaScript-ის მეშვეობით შესაძლებელია ინტერაქტიული ვებ გვერდების შექმნა, სერვერთან მოთხოვნების გაგზავნის გარეშე, რაც იმას ნიშნავს, რომ ამ დაპროგრამების ენის მეშვეობით შეიძლება შეიქმნას დინამიური ვებ სისტემები.'
    },
    {
        id: 8,
        title: 'C პროგრამირების ენა',
        professor: 'მაქსიმ იავიჩი',
        text: 'სასწავლო კურსის მიზანია სტუდენტებს ასწავლოს პროგრამების წერა C++ პროგრამირების ენაზე. კურსის მიზანი ასევე არის სტუდენტებს ასწავლოს C პროგრამირების ენაზე დაწერილი პროგრამების წაკითხვა და გაანალიზება კოდში შესაძლო სუსტი წერტილების დასადგენად.'
    },

];

export default Courses;